# BuiltInFailures.BlendFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..BlendFailures Class
BuiltInFailures Class Members See Also
---
Failures about Blend.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class BlendFailures
```

Visual Basic
---
```text
Public NotInheritable Class BlendFailures
```

Visual C++
---
```text
public ref class BlendFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..BlendFailures
# See Also
BuiltInFailures..::..BlendFailures Members
Autodesk.Revit.DB Namespace